dirCustomOrg/customMeORG.el
;Automatizar mis plugins para que se instalen solos si no los tengo.
;; (use-package yasnippet :config (yas-global-mode))
;; (use-package yasnippet-snippets :ensure t)

;yasnippet
(add-to-list 'load-path
              "~/.emacs.d/plugins/yasnippet")
(require 'yasnippet)
(yas-global-mode 1)
