dirCustomOrg/customMeORG.org
* AjustandoFrame
  Ajusta la pantalla.
#+BEGIN_SRC emacs-lisp

;progn me parece es para agrupar varias sentencias ene un if.

;Set default size windows
(if (display-graphic-p)
    (progn
      (setq initial-frame-alist
            '(
              (tool-bar-lines . 0)
              (width . 117) ; chars
              (height . 31) ; lines
              ;(background-color . "#1D1F21") ;Tono mas suave para dream.
              ))
      (setq default-frame-alist
            '(
              (tool-bar-lines . 0)
              (width . 117)
              (height . 31)
              ;(background-color . "#1D1F21")
              ))
      (set-frame-position (selected-frame) 300 175) ;My ajustando posicion del frame.
      )
  (progn
    (setq initial-frame-alist '( (tool-bar-lines . 0)))
    (setq default-frame-alist '( (tool-bar-lines . 0))))
)

; Para que agarre el color en nw, es decir, terminal
; Reference: https://emacs.stackexchange.com/questions/47452/why-doesnt-set-background-color-work-in-my-init-file
(if (eq window-system 'nil)    
     (add-to-list 'default-frame-alist '(background-color . "#1D1F21"))     
  )



; Puedes mostrar los coloser con M-x list-colors-display
; Y ajustar la franje del marcado con:
;(set-face-background 'region "#7f7f7f") ;Adecuado para theme dream in terminal.

#+END_SRC

* HowInstallPlugin
#+BEGIN_SRC emacs-lisp
; Example how install plugins.
;; (add-to-list 'load-path "/home/guillermo/.emacs.d/plugins/powerline/")
;; (require 'powerline) ; or (load 'file)
;; (powerline-default-theme)
;; (set-cursor-color "orange")
;; (set-background-color "#000000") 
#+END_SRC
* Other
#+BEGIN_SRC emacs-lisp
(custom-set-variables
 ;; custom-set-variables was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 '(package-selected-packages
   '(sublime-themes default-text-scale color-theme-sanityinc-tomorrow helm-lsp quickrun company-bootstrap doom-modeline multiple-cursors flymd company-box company-quickhelp mode-icons yasnippet-snippets which-key web-mode use-package rainbow-delimiters projectile nyan-mode neotree magit lsp-java langtool kaolin-themes impatient-mode highlight-numbers highlight-escape-sequences helm google-translate flycheck exec-path-from-shell emmet-mode eglot dumb-jump doom-themes define-word dashboard counsel company-web company-c-headers all-the-icons ac-html-csswatcher ac-html ac-clang ac-capf ac-c-headers)))


#+END_SRC
